Revit 2024 API
DockableFrameFocusChangedEventArgs Properties
The DockableFrameFocusChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
FocusGained
 True if the pane is being activated, false if it is being inactivated.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
PaneId
 The identifier for dockable pane.
See Also
DockableFrameFocusChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace